Tekla Open API Reference for Tekla Structures 2025
InputDefinitionFactory Class
 The InputDefinitionFactory class contains helper functions for input definition handling.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.Tools.InputDefinitionFactory
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class InputDefinitionFactory
Public Class InputDefinitionFactory
The InputDefinitionFactory type exposes the following members.
Constructors
Name | Description
InputDefinitionFactory
Initializes a new instance of the InputDefinitionFactory class
Top
Methods
Name | Description
CreateInputDefinition(Tuple<DrawingObject, ViewBase>)
 Creates a single-object input definition.
CreateInputDefinition(Tuple<Point, ViewBase>)
 Creates a single-point input definition.
CreateInputDefinition(Tuple<PointList, ViewBase>)
 Creates a multi-point input definition.
CreateInputDefinition(ViewBase, DrawingObject)
 Creates a single-object input definition.
CreateInputDefinition(ViewBase, PointList)
 Creates a multi-point input definition.
CreateInputDefinition(ViewBase, Point)
 Creates a single-point input definition.
CreateInputDefinition(ViewBase, Point, Point)
 Creates a two-point input definition.
CreateInputDefinition(ViewBase, Point, Point, Point)
 Creates a three-point input definition.
GetDrawingObject
 Gets the object from the given single-object input.
GetPoint
 Gets the point from the given single-point input.
GetPoints
 Gets the points from the given n-point input.
GetView
 Gets the view that the given input belongs to.
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.UI;
using Tekla.Structures.Drawing.Tools;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Plugins;
public class Example
{
       public void Example1()
       {
           var drawingHandler = new DrawingHandler();
           Picker picker = drawingHandler.GetPicker();
           var pick = picker.PickPoint("Pick a point");
           var inputDefinition = InputDefinitionFactory.CreateInputDefinition(pick);
           ViewBase myView = InputDefinitionFactory.GetView(inputDefinition);
           Point myPoint = InputDefinitionFactory.GetPoint(inputDefinition);
       }
}
See Also
Reference
Tekla.Structures.Drawing.Tools Namespace